stm32-hotspot/STM32WBA-BLE-GenericHealthSensor/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_GenericHealthSensor/STM32_WPAN/App/ghs.c
            switch(p_attribute_modified->Attr_Data[0])
            {
              /* USER CODE BEGIN Service1_Char_1_attribute_modified */

              /* USER CODE END Service1_Char_1_attribute_modified */

              /* Disabled Indication management */
              case (!(COMSVC_Indication)):
                /* USER CODE BEGIN Service1_Char_1_Disabled_BEGIN */

                /* USER CODE END Service1_Char_1_Disabled_BEGIN */
                notification.EvtOpcode = GHS_HSF_INDICATE_DISABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_1_Disabled_END */

                /* USER CODE END Service1_Char_1_Disabled_END */
                break;

              /* Enabled Indication management */
              case COMSVC_Indication:
                /* USER CODE BEGIN Service1_Char_1_COMSVC_Indication_BEGIN */

                /* USER CODE END Service1_Char_1_COMSVC_Indication_BEGIN */
                notification.EvtOpcode = GHS_HSF_INDICATE_ENABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_1_COMSVC_Indication_END */

                /* USER CODE END Service1_Char_1_COMSVC_Indication_END */
                break;

              default:
                /* USER CODE BEGIN Service1_Char_1_default */

                /* USER CODE END Service1_Char_1_default */
                break;
            }
          }  /* if(p_attribute_modified->Attr_Handle == (GHS_Context.HSFHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))*/

          else if(p_attribute_modified->Attr_Handle == (GHS_Context.LhoCharHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))
          {
            return_value = SVCCTL_EvtAckFlowEnable;
            /* USER CODE BEGIN Service1_Char_2 */

            /* USER CODE END Service1_Char_2 */

            switch(p_attribute_modified->Attr_Data[0])
            {
              /* USER CODE BEGIN Service1_Char_2_attribute_modified */

              /* USER CODE END Service1_Char_2_attribute_modified */

              /* Disabled Notification and Indication management */
              case (!(COMSVC_Notification) | !(COMSVC_Indication)):
                /* USER CODE BEGIN Service1_Char_2_Disabled_BEGIN */

                /* USER CODE END Service1_Char_2_Disabled_BEGIN */
                notification.EvtOpcode = GHS_LHO_NOTIFY_DISABLED_EVT;
                GHS_Notification(&notification);
                notification.EvtOpcode = GHS_LHO_INDICATE_DISABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_2_Disabled_END */

                /* USER CODE END Service1_Char_2_Disabled_END */
                break;

              /* Enabled Notification management */
              case COMSVC_Notification:
                /* USER CODE BEGIN Service1_Char_2_COMSVC_Notification_BEGIN */

                /* USER CODE END Service1_Char_2_COMSVC_Notification_BEGIN */
                notification.EvtOpcode = GHS_LHO_NOTIFY_ENABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_2_COMSVC_Notification_END */

                /* USER CODE END Service1_Char_2_COMSVC_Notification_END */
                break;

              /* Enabled Indication management */
              case COMSVC_Indication:
                /* USER CODE BEGIN Service1_Char_2_COMSVC_Indication_BEGIN */

                /* USER CODE END Service1_Char_2_COMSVC_Indication_BEGIN */
                notification.EvtOpcode = GHS_LHO_INDICATE_ENABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_2_COMSVC_Indication_END */

                /* USER CODE END Service1_Char_2_COMSVC_Indication_END */
                break;

              default:
                /* USER CODE BEGIN Service1_Char_2_default */

                /* USER CODE END Service1_Char_2_default */
                break;
            }
          }  /* if(p_attribute_modified->Attr_Handle == (GHS_Context.LhoCharHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))*/

          else if(p_attribute_modified->Attr_Handle == (GHS_Context.ShoCharHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))
          {
            return_value = SVCCTL_EvtAckFlowEnable;
            /* USER CODE BEGIN Service1_Char_3 */
            LOG_INFO_APP("p_attribute_modified->Attr_Data[0] (0x%02X)\r\n", p_attribute_modified->Attr_Data[0]);
            /* USER CODE END Service1_Char_3 */

            switch(p_attribute_modified->Attr_Data[0])
            {
              /* USER CODE BEGIN Service1_Char_3_attribute_modified  */

              /* USER CODE END Service1_Char_3_attribute_modified  */

              /* Disabled Notification and Indication management */
              case (!(COMSVC_Notification) | !(COMSVC_Indication)):
                /* USER CODE BEGIN Service1_Char_3_Disabled_BEGIN  */

                /* USER CODE END Service1_Char_3_Disabled_BEGIN  */
                notification.EvtOpcode = GHS_SHO_NOTIFY_DISABLED_EVT;
                GHS_Notification(&notification);
                notification.EvtOpcode = GHS_SHO_INDICATE_DISABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_3_Disabled_END */

                /* USER CODE END Service1_Char_3_Disabled_END */
                break;

              /* Enabled Notification management */
              case COMSVC_Notification:
                /* USER CODE BEGIN Service1_Char_3_COMSVC_Notification_BEGIN */

                /* USER CODE END Service1_Char_3_COMSVC_Notification_BEGIN */
                notification.EvtOpcode = GHS_SHO_NOTIFY_ENABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_3_COMSVC_Notification_END */

                /* USER CODE END Service1_Char_3_COMSVC_Notification_END */
                break;

              /* Enabled Indication management */
              case COMSVC_Indication:
                /* USER CODE BEGIN Service1_Char_3_COMSVC_Indication_BEGIN */

                /* USER CODE END Service1_Char_3_COMSVC_Indication_BEGIN */
                notification.EvtOpcode = GHS_SHO_INDICATE_ENABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_3_COMSVC_Indication_END */

