stm32-hotspot/STM32WBA-BLE-GenericHealthSensor/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_GenericHealthSensor/STM32_WPAN/App/ghs.c
                /* USER CODE END Service1_Char_3_COMSVC_Indication_END */
                break;

              case (COMSVC_Indication | COMSVC_Notification):
                /* USER CODE BEGIN Service1_Char_3_COMSVC_Indication_BEGIN */

                /* USER CODE END Service1_Char_3_COMSVC_Indication_BEGIN */
                notification.EvtOpcode = GHS_SHO_NOTIFY_ENABLED_EVT;
                GHS_Notification(&notification);
                notification.EvtOpcode = GHS_SHO_INDICATE_ENABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_3_COMSVC_Indication_END */

                /* USER CODE END Service1_Char_3_COMSVC_Indication_END */
                break;

              default:
                /* USER CODE BEGIN Service1_Char_3_default */

                /* USER CODE END Service1_Char_3_default */
                break;
            }
          }  /* if(p_attribute_modified->Attr_Handle == (GHS_Context.ShoCharHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))*/

          else if(p_attribute_modified->Attr_Handle == (GHS_Context.RacpCharHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))
          {
            return_value = SVCCTL_EvtAckFlowEnable;
            /* USER CODE BEGIN Service1_Char_4 */

            /* USER CODE END Service1_Char_4 */

            switch(p_attribute_modified->Attr_Data[0])
            {
              /* USER CODE BEGIN Service1_Char_4_attribute_modified */

              /* USER CODE END Service1_Char_4_attribute_modified */

              /* Disabled Indication management */
              case (!(COMSVC_Indication)):
                /* USER CODE BEGIN Service1_Char_4_Disabled_BEGIN */

                /* USER CODE END Service1_Char_4_Disabled_BEGIN */
                notification.EvtOpcode = GHS_RACP_INDICATE_DISABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_4_Disabled_END */

                /* USER CODE END Service1_Char_4_Disabled_END */
                break;

              /* Enabled Indication management */
              case COMSVC_Indication:
                /* USER CODE BEGIN Service1_Char_4_COMSVC_Indication_BEGIN */

                /* USER CODE END Service1_Char_4_COMSVC_Indication_BEGIN */
                notification.EvtOpcode = GHS_RACP_INDICATE_ENABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_4_COMSVC_Indication_END */

                /* USER CODE END Service1_Char_4_COMSVC_Indication_END */
                break;

              default:
                /* USER CODE BEGIN Service1_Char_4_default */

                /* USER CODE END Service1_Char_4_default */
                break;
            }
          }  /* if(p_attribute_modified->Attr_Handle == (GHS_Context.RACPHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))*/

          else if(p_attribute_modified->Attr_Handle == (GHS_Context.GhscpCharHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))
          {
            return_value = SVCCTL_EvtAckFlowEnable;
            /* USER CODE BEGIN Service1_Char_5 */

            /* USER CODE END Service1_Char_5 */

            switch(p_attribute_modified->Attr_Data[0])
            {
              /* USER CODE BEGIN Service1_Char_5_attribute_modified */

              /* USER CODE END Service1_Char_5_attribute_modified */

              /* Disabled Indication management */
              case (!(COMSVC_Indication)):
                /* USER CODE BEGIN Service1_Char_5_Disabled_BEGIN */

                /* USER CODE END Service1_Char_5_Disabled_BEGIN */
                notification.EvtOpcode = GHS_GHSCP_INDICATE_DISABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_5_Disabled_END */

                /* USER CODE END Service1_Char_5_Disabled_END */
                break;

              /* Enabled Indication management */
              case COMSVC_Indication:
                /* USER CODE BEGIN Service1_Char_5_COMSVC_Indication_BEGIN */

                /* USER CODE END Service1_Char_5_COMSVC_Indication_BEGIN */
                notification.EvtOpcode = GHS_GHSCP_INDICATE_ENABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_5_COMSVC_Indication_END */

                /* USER CODE END Service1_Char_5_COMSVC_Indication_END */
                break;

              default:
                /* USER CODE BEGIN Service1_Char_5_default */

                /* USER CODE END Service1_Char_5_default */
                break;
            }
          }  /* if(p_attribute_modified->Attr_Handle == (GHS_Context.GHSCPHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))*/

          else if(p_attribute_modified->Attr_Handle == (GHS_Context.OscCharHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))
          {
            return_value = SVCCTL_EvtAckFlowEnable;
            /* USER CODE BEGIN Service1_Char_6 */

            /* USER CODE END Service1_Char_6 */

            switch(p_attribute_modified->Attr_Data[0])
            {
              /* USER CODE BEGIN Service1_Char_6_attribute_modified */

              /* USER CODE END Service1_Char_6_attribute_modified */

              /* Disabled Indication management */
              case (!(COMSVC_Indication)):
                /* USER CODE BEGIN Service1_Char_6_Disabled_BEGIN */

                /* USER CODE END Service1_Char_6_Disabled_BEGIN */
                notification.EvtOpcode = GHS_OSC_INDICATE_DISABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_6_Disabled_END */

                /* USER CODE END Service1_Char_6_Disabled_END */
                break;

              /* Enabled Indication management */
              case COMSVC_Indication:
                /* USER CODE BEGIN Service1_Char_6_COMSVC_Indication_BEGIN */

                /* USER CODE END Service1_Char_6_COMSVC_Indication_BEGIN */
                notification.EvtOpcode = GHS_OSC_INDICATE_ENABLED_EVT;
                GHS_Notification(&notification);
                /* USER CODE BEGIN Service1_Char_6_COMSVC_Indication_END */

                /* USER CODE END Service1_Char_6_COMSVC_Indication_END */
                break;

              default:
                /* USER CODE BEGIN Service1_Char_6_default */

