stm32-hotspot/STM32WBA-BLE-GenericHealthSensor/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_GenericHealthSensor/STM32_WPAN/App/ghs.c
                /* USER CODE END Service1_Char_6_default */
                break;
            }
          }  /* if(p_attribute_modified->Attr_Handle == (GHS_Context.OSCHdle + CHARACTERISTIC_DESCRIPTOR_ATTRIBUTE_OFFSET))*/

          else if(p_attribute_modified->Attr_Handle == (GHS_Context.RacpCharHdle + CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
          {
            return_value = SVCCTL_EvtAckFlowEnable;

            notification.EvtOpcode = GHS_RACP_WRITE_EVT;
            /* USER CODE BEGIN Service1_Char_4_ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE */

            /* USER CODE END Service1_Char_4_ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE */
            GHS_Notification(&notification);
          } /* if(p_attribute_modified->Attr_Handle == (GHS_Context.RacpCharHdle + CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))*/
          else if(p_attribute_modified->Attr_Handle == (GHS_Context.GhscpCharHdle + CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
          {
            return_value = SVCCTL_EvtAckFlowEnable;

            notification.EvtOpcode = GHS_GHSCP_WRITE_EVT;
            /* USER CODE BEGIN Service1_Char_5_ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE */

            /* USER CODE END Service1_Char_5_ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE */
            GHS_Notification(&notification);
          } /* if(p_attribute_modified->Attr_Handle == (GHS_Context.GhscpCharHdle + CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))*/

          /* USER CODE BEGIN EVT_BLUE_GATT_ATTRIBUTE_MODIFIED_END */

          /* USER CODE END EVT_BLUE_GATT_ATTRIBUTE_MODIFIED_END */
          break;/* ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE */
        }
        case ACI_GATT_READ_PERMIT_REQ_VSEVT_CODE :
        {
          /* USER CODE BEGIN EVT_BLUE_GATT_READ_PERMIT_REQ_BEGIN */

          /* USER CODE END EVT_BLUE_GATT_READ_PERMIT_REQ_BEGIN */

          /* USER CODE BEGIN EVT_BLUE_GATT_READ_PERMIT_REQ_END */

          /* USER CODE END EVT_BLUE_GATT_READ_PERMIT_REQ_END */
          break;/* ACI_GATT_READ_PERMIT_REQ_VSEVT_CODE */
        }
        case ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE:
        {
          /* USER CODE BEGIN EVT_BLUE_GATT_WRITE_PERMIT_REQ_BEGIN */

          /* USER CODE END EVT_BLUE_GATT_WRITE_PERMIT_REQ_BEGIN */
          p_write_perm_req = (aci_gatt_write_permit_req_event_rp0*)p_blecore_evt->data;
          if(p_write_perm_req->Attribute_Handle == (GHS_Context.RacpCharHdle + CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
          {
            return_value = SVCCTL_EvtAckFlowEnable;
            /*USER CODE BEGIN Service1_Char_4_ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE */
            LOG_INFO_APP("ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE GHS_RACP, data length: %d\r\n", p_write_perm_req->Data_Length);
        
            error_code = GHS_RACP_CheckRequestValid(p_write_perm_req->Data, p_write_perm_req->Data_Length);
            if (error_code == 0x00)
            {
              aci_gatt_write_resp(p_write_perm_req->Connection_Handle,
                                  p_write_perm_req->Attribute_Handle,
                                  0x00,
                                  0x00,
                                  p_write_perm_req->Data_Length,
                                  p_write_perm_req->Data);
          
              LOG_INFO_APP("ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE GHS_RACP >>> PERMITTED\r\n");
              GHS_RACP_RequestHandler(p_write_perm_req->Data, p_write_perm_req->Data_Length);
            }
            else 
            {
              aci_gatt_write_resp(p_write_perm_req->Connection_Handle,
                                  p_write_perm_req->Attribute_Handle,
                                  0x01,
                                  error_code,
                                  p_write_perm_req->Data_Length,
                                  p_write_perm_req->Data);
              if(error_code == GHS_ATT_ERROR_CODE_PROCEDURE_ALREADY_IN_PROGRESS)
              {
                LOG_INFO_APP("ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE GHS_RACP >>> PROCEDURE ALREADY IN PROGRESS (0x%02X)\r\n", error_code);
              }
              else if(error_code == GHS_ATT_ERROR_CODE_CLIENT_CHAR_CONF_DESC_IMPROPERLY_CONFIGURED)
              {
                LOG_INFO_APP("ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE GHS_RACP >>> CLIENT CHAR CONF DESC IMPROPERLY CONFIGURED (0x%02X)\r\n", error_code);
              }
            }
            /*USER CODE END Service1_Char_4_ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE*/
          } /*if(p_write_perm_req->Attribute_Handle == (GHS_Context.RacpCharHdle + CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))*/

          else if(p_write_perm_req->Attribute_Handle == (GHS_Context.GhscpCharHdle + CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
          {
            return_value = SVCCTL_EvtAckFlowEnable;
            /*USER CODE BEGIN Service1_Char_5_ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE */
            LOG_INFO_APP("ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE GHS_CP, data length: %d\r\n", p_write_perm_req->Data_Length);
        
            error_code = GHS_CP_CheckRequestValid(p_write_perm_req->Data, p_write_perm_req->Data_Length);
            if (error_code == 0x00)
            {
              aci_gatt_write_resp(p_write_perm_req->Connection_Handle,
                                  p_write_perm_req->Attribute_Handle,
                                  0x00,
                                  0x00,
                                  p_write_perm_req->Data_Length,
                                  p_write_perm_req->Data);
          
              LOG_INFO_APP("ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE GHS_CP >>> PERMITTED\r\n");
              GHS_CP_RequestHandler(p_write_perm_req->Data, p_write_perm_req->Data_Length);
            }
            else 
            {
              aci_gatt_write_resp(p_write_perm_req->Connection_Handle,
                                  p_write_perm_req->Attribute_Handle,
                                  0x01,
                                  error_code,
                                  p_write_perm_req->Data_Length,
                                  p_write_perm_req->Data);
              LOG_INFO_APP("ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE GHS_CP >>> NOT PERMITTED\r\n");
            }
            /*USER CODE END Service1_Char_5_ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE*/
          } /*if(p_write_perm_req->Attribute_Handle == (GHS_Context.GhscpCharHdle + CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))*/

          /* USER CODE BEGIN EVT_BLUE_GATT_WRITE_PERMIT_REQ_END */
          else if((p_write_perm_req->Attribute_Handle == (GHS_Context.OscDescHdle[0])) ||
                  (p_write_perm_req->Attribute_Handle == (GHS_Context.OscDescHdle[1])))
          {
            return_value = SVCCTL_EvtAckFlowEnable;

            uint32_t observation_type =  p_write_perm_req->Data[0] |
                                        ((p_write_perm_req->Data[1]) << 8) | 
                                        ((p_write_perm_req->Data[2]) << 16) | 
                                        ((p_write_perm_req->Data[3]) << 24);
            uint32_t measurement_period =   p_write_perm_req->Data[4] |
                                          ((p_write_perm_req->Data[5]) << 8) | 
                                          ((p_write_perm_req->Data[6]) << 16) |
                                          ((p_write_perm_req->Data[7]) << 24);
            uint32_t update_interval =   p_write_perm_req->Data[8] |
                                       ((p_write_perm_req->Data[9]) << 8) | 
                                       ((p_write_perm_req->Data[10]) << 16) |
                                       ((p_write_perm_req->Data[11]) << 24);
            if(((observation_type != (ObservationSchedule[0].ObservationType)) && 
                (observation_type != (ObservationSchedule[1].ObservationType))) ||
               (update_interval > measurement_period) ||
               (measurement_period == UNSUPPORTED_MEASUREMENT_PERIOD) ||
               (update_interval == UNSUPPORTED_UPDATE_INTERVAL))
            {
              aci_gatt_write_resp(p_write_perm_req->Connection_Handle,
                                  p_write_perm_req->Attribute_Handle,
                                  0x01,
                                  GHS_ATT_ERROR_CODE_OUT_OF_RANGE,
                                  p_write_perm_req->Data_Length,
                                  p_write_perm_req->Data);
            }
            else
            {
              aci_gatt_write_resp(p_write_perm_req->Connection_Handle,
                                  p_write_perm_req->Attribute_Handle,
                                  0x00,
                                  0x00,
                                  p_write_perm_req->Data_Length,
                                  p_write_perm_req->Data);
            }
          }
          /* USER CODE END EVT_BLUE_GATT_WRITE_PERMIT_REQ_END */
          break;/* ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE */
        }
        case ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE:
        {
          aci_gatt_tx_pool_available_event_rp0 *p_tx_pool_available_event;
          p_tx_pool_available_event = (aci_gatt_tx_pool_available_event_rp0 *) p_blecore_evt->data;
          UNUSED(p_tx_pool_available_event);

          /* USER CODE BEGIN ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */

          /* USER CODE END ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */
          break;/* ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE*/
        }
        case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
        {
          aci_att_exchange_mtu_resp_event_rp0 *p_exchange_mtu;
          p_exchange_mtu = (aci_att_exchange_mtu_resp_event_rp0 *)  p_blecore_evt->data;
          UNUSED(p_exchange_mtu);

