stm32-hotspot/STM32WBA-BLE-GenericHealthSensor/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_GenericHealthSensor/STM32_WPAN/App/ghs.c
          /* USER CODE BEGIN ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */

          /* USER CODE END ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */
          break;/* ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */
        }
        /* USER CODE BEGIN BLECORE_EVT */
        case ACI_GATT_SERVER_CONFIRMATION_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_GATT_SERVER_CONFIRMATION_VSEVT_CODE\n");
          UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_GATT_INDICATION_COMPLETE);
        }
        break;
        /* USER CODE END BLECORE_EVT */
        default:
          /* USER CODE BEGIN EVT_DEFAULT */

          /* USER CODE END EVT_DEFAULT */
          break;
      }
      /* USER CODE BEGIN EVT_VENDOR*/

      /* USER CODE END EVT_VENDOR*/
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT_CASES*/

      /* USER CODE END EVENT_PCKT_CASES*/

    default:
      /* USER CODE BEGIN EVENT_PCKT*/

      /* USER CODE END EVENT_PCKT*/
      break;
  }

  /* USER CODE BEGIN Service1_EventHandler_2 */

  /* USER CODE END Service1_EventHandler_2 */

  return(return_value);
}/* end GHS_EventHandler */

/* Public functions ----------------------------------------------------------*/

/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void GHS_Init(void)
{
  Char_UUID_t  uuid;
  tBleStatus ret;
  uint8_t max_attr_record;

  /* USER CODE BEGIN SVCCTL_InitService1Svc_1 */

  /* USER CODE END SVCCTL_InitService1Svc_1 */

  /**
   *  Register the event handler to the BLE controller
   */
  SVCCTL_RegisterSvcHandler(GHS_EventHandler);

  /**
   * GHS
   *
   * Max_Attribute_Records = 1 + 2*6 + 1*no_of_char_with_notify_or_indicate_property + 1*no_of_char_with_broadcast_property
   * service_max_attribute_record = 1 for GHS +
   *                                2 for HSF +
   *                                2 for LHO +
   *                                2 for SHO +
   *                                2 for RACP +
   *                                2 for GHSCP +
   *                                2 for OSC +
   *                                1 for HSF configuration descriptor +
   *                                1 for LHO configuration descriptor +
   *                                1 for SHO configuration descriptor +
   *                                1 for RACP configuration descriptor +
   *                                1 for GHSCP configuration descriptor +
   *                                1 for OSC configuration descriptor +
   *                              = 19
   * This value doesn't take into account number of descriptors manually added
   * In case of descriptors added, please update the max_attr_record value accordingly in the next SVCCTL_InitService User Section
   */
  max_attr_record = 19;

  /* USER CODE BEGIN SVCCTL_InitService */
  /* max_attr_record to be updated if descriptors have been added */
  /* Added 1 Observation Schedule descriptor and 1 Valid Range and Accuracy descriptor per Supported Observation Type */
  max_attr_record += 2*NB_SUPPORTED_OBSERVATION_TYPES;
  /* USER CODE END SVCCTL_InitService */

  uuid.Char_UUID_16 = 0x1840;
  ret = aci_gatt_add_service(UUID_TYPE_16,
                             (Service_UUID_t *) &uuid,
                             PRIMARY_SERVICE,
                             max_attr_record,
                             &(GHS_Context.GhsSvcHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_service command: GHS, error code: 0x%x \n\r", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_service command: GHS \n\r");
  }

  /**
   * HSF
   */
  uuid.Char_UUID_16 = 0x2bf3;
  ret = aci_gatt_add_char(GHS_Context.GhsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeHsf,
                          CHAR_PROP_READ | CHAR_PROP_INDICATE,
                          ATTR_PERMISSION_AUTHOR_WRITE,
                          GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
                          0x10,
                          CHAR_VALUE_LEN_VARIABLE,
                          &(GHS_Context.HsfCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : HSF, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : HSF\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char1 */
  /* Place holder for Characteristic Descriptors */
  for(uint8_t i = 0; i < NB_SUPPORTED_OBSERVATION_TYPES; i++)
  {
    /**
     * Observation Schedule descriptor
     */
    uuid.Char_UUID_16 = 0x2910;

    /* add the Observation Schedule descriptor */
    ret = aci_gatt_add_char_desc(GHS_Context.GhsSvcHdle, 
                                 GHS_Context.HsfCharHdle, 
                                 UUID_TYPE_16,
                                 (Char_Desc_Uuid_t *)&uuid, 
                                 SizeOscDesc,
                                 SizeOscDesc,
                                 (void *)&(ObservationSchedule[i]),
                                 ATTR_PERMISSION_NONE,
                                 ATTR_ACCESS_READ_WRITE,
                                 GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
                                 0x10, 
                                 CHAR_VALUE_LEN_CONSTANT,
                                 &(GHS_Context.OscDescHdle[i]));
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_gatt_add_char_desc command   : OSC DESC%d, error code: 0x%2X\n", i, ret);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_gatt_add_char_desc command   : OSC DESC%d on handle 0x%x\n",
                  i, GHS_Context.OscDescHdle);
    }

    /**
     * Valid Range and Accuracy descriptor
     */
    uuid.Char_UUID_16 = 0x2911;
    /* add the Valid Range and Accuracy descriptor */
    ret = aci_gatt_add_char_desc(GHS_Context.GhsSvcHdle, 
                                 GHS_Context.HsfCharHdle, 
                                 UUID_TYPE_16,
                                 (Char_Desc_Uuid_t *)&uuid, 
                                 SizeVraDesc,
                                 SizeVraDesc,
                                 (void *)&(ValidRangeAccuracy[i]),
                                 ATTR_PERMISSION_NONE,
                                 ATTR_ACCESS_READ_ONLY,
                                 GATT_DONT_NOTIFY_EVENTS,
                                 0x10, 
                                 CHAR_VALUE_LEN_CONSTANT,
                                 &(GHS_Context.VraDescHdle[i]));
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_gatt_add_char_desc command   : VRA DESC%d, error code: 0x%2X\n", i, ret);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_gatt_add_char_desc command   : VRA DESC%d on handle 0x%x\n",
                  i, GHS_Context.VraDescHdle);
    }
  } /* End for(uint8_t i = 0; i < NB_SUPPORTED_OBSERVATION_TYPES; i++) */
  /* USER CODE END SVCCTL_InitService1Char1 */

  /**
   * LHO
   */
  uuid.Char_UUID_16 = 0x2b8b;
  ret = aci_gatt_add_char(GHS_Context.GhsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeLho,
                          CHAR_PROP_NOTIFY | CHAR_PROP_INDICATE,
                          ATTR_PERMISSION_NONE,
                          GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
                          0x10,
                          CHAR_VALUE_LEN_VARIABLE,
                          &(GHS_Context.LhoCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : LHO, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : LHO\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char2 */
  /* Place holder for Characteristic Descriptors */

  /* USER CODE END SVCCTL_InitService1Char2 */

  /**
   * SHO
   */
  uuid.Char_UUID_16 = 0x2bdd;
  ret = aci_gatt_add_char(GHS_Context.GhsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeSho,
                          CHAR_PROP_NOTIFY | CHAR_PROP_INDICATE,
                          ATTR_PERMISSION_NONE,
                          GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
                          0x10,
                          CHAR_VALUE_LEN_VARIABLE,
                          &(GHS_Context.ShoCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : SHO, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : SHO\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char3 */
  /* Place holder for Characteristic Descriptors */

  /* USER CODE END SVCCTL_InitService1Char3 */

  /**
   * RACP
   */
  uuid.Char_UUID_16 = 0x2a52;
  ret = aci_gatt_add_char(GHS_Context.GhsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeRacp,
                          CHAR_PROP_WRITE | CHAR_PROP_INDICATE,
                          ATTR_PERMISSION_NONE,
                          GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
                          0x10,
                          CHAR_VALUE_LEN_VARIABLE,
                          &(GHS_Context.RacpCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : RACP, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : RACP\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char4 */
  /* Place holder for Characteristic Descriptors */

  /* USER CODE END SVCCTL_InitService1Char4 */

  /**
   * GHSCP
   */
  uuid.Char_UUID_16 = 0x2bf4;
  ret = aci_gatt_add_char(GHS_Context.GhsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeGhscp,
                          CHAR_PROP_WRITE | CHAR_PROP_INDICATE,
                          ATTR_PERMISSION_NONE,
                          GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
                          0x10,
                          CHAR_VALUE_LEN_CONSTANT,
                          &(GHS_Context.GhscpCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : GHSCP, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : GHSCP\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char5 */
  /* Place holder for Characteristic Descriptors */

  /* USER CODE END SVCCTL_InitService1Char5 */

  /**
   * OSC
   */
  uuid.Char_UUID_16 = 0x2bf1;
  ret = aci_gatt_add_char(GHS_Context.GhsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeOsc,
                          CHAR_PROP_INDICATE,
                          ATTR_PERMISSION_NONE,
                          GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
                          0x10,
                          CHAR_VALUE_LEN_CONSTANT,
                          &(GHS_Context.OscCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : OSC, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : OSC\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char6 */
  /* Place holder for Characteristic Descriptors */

